Revit 2024 API
BendingDetailCustomFieldProperties.AngularDimensionsEnabled Property
 Identifies if any angular dimensions will be shown or not.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public bool AngularDimensionsEnabled { get; set; }
Visual Basic
Public Property AngularDimensionsEnabled As Boolean
	Get
	Set
Visual C++
public:
property bool AngularDimensionsEnabled {
	bool get ();
	void set (bool value);
}
See Also
BendingDetailCustomFieldProperties Class
Autodesk.Revit.DB.Structure Namespace